[
  { "id": "q1", "q": "When should you pick Spanner instead of BigQuery or Bigtable?", "a": "Pick Spanner for global, strongly consistent relational workloads needing horizontal scale and 99.999% availability." },
  { "id": "q2", "q": "What is the key difference between Bigtable and BigQuery?", "a": "Bigtable is low-latency NoSQL for massive time-series/IoT; BigQuery is a serverless analytics warehouse for SQL on petabytes." },
  { "id": "q3", "q": "Best use case for Cloud SQL?", "a": "Managed MySQL/PostgreSQL/SQL Server for transactional apps needing HA, read replicas, and point-in-time recovery." },
  { "id": "q4", "q": "Dataflow vs Dataproc?", "a": "Dataflow (Beam) is serverless for streaming/batch with autoscaling; Dataproc is managed Spark/Hadoop for lift-and-shift jobs." },
  { "id": "q5", "q": "How do you preserve ordering in Pub/Sub?", "a": "Use ordering keys; Pub/Sub is at-least-once with a 7-day replay window." },
  { "id": "q6", "q": "Partitioning vs clustering in BigQuery?", "a": "Partition to prune by date/int; cluster up to 4 columns to sort data physically and speed filters/order by on clustered fields." },
  { "id": "q7", "q": "What are BigQuery DML and streaming limits?", "a": "Max 96 concurrent DML per table; streaming buffers about 1 MB/s and 500K rows/s per table with insertId for dedupe." },
  { "id": "q8", "q": "Why use BigQuery Authorized Views?", "a": "To share data securely without copying tables; apply IAM on the view for consumers." },
  { "id": "q9", "q": "What are BigQuery materialized view types?", "a": "Smart (auto incremental refresh) vs Standard (manual refresh) for frequently-used aggregations." },
  { "id": "q10", "q": "Key Beam windowing options?", "a": "Fixed, Sliding, Session, Global—pick based on aggregation horizon and lateness handling." },
  { "id": "q11", "q": "How to achieve exactly-once in Dataflow?", "a": "Need sink support and idempotent writes; often combine GroupByKey with insertId-based deduplication." },
  { "id": "q12", "q": "Ingestion choices for >100 TB offline?", "a": "Use Transfer Appliance; for S3/URLs→GCS use Storage Transfer Service; for streaming use Pub/Sub + Dataflow." },
  { "id": "q13", "q": "What do BigQuery Policy Tags provide?", "a": "Column-level ACLs; combine with Authorized Views for fine-grained governance." },
  { "id": "q14", "q": "How to handle PII before analytics in GCP?", "a": "Use DLP API to inspect, mask, or tokenize sensitive data before landing in analytics tables." },
  { "id": "q15", "q": "How do you monitor BigQuery cost and usage?", "a": "Use Information Schema/Admin tables for job history and spend; monitor slot usage; leverage Reservations and Flex Slots." },
  { "id": "q16", "q": "Reliability pattern for Cloud SQL?", "a": "Deploy HA primary with regional or cross-region read replicas plus point-in-time recovery." },
  { "id": "q17", "q": "Spanner availability target and why?", "a": "Multi-region Spanner provides a 99.999% SLA with global transactions and strong consistency." },
  { "id": "q18", "q": "How to raise GCS availability?", "a": "Use dual-region or multi-region buckets; apply lifecycle policies to move objects to Nearline/Coldline/Archive for cost." },
  { "id": "q19", "q": "Canonical streaming analytics pattern on GCP?", "a": "Pub/Sub → Dataflow → BigQuery with windowing, triggers, and idempotent sinks for near real-time analytics." },
  { "id": "q20", "q": "When to use Dataplex versus Data Catalog?", "a": "Dataplex manages lakes→zones→assets with governance; Data Catalog provides metadata search and tagging across data." },
  { "id": "q21", "q": "CMEK vs Google-managed encryption keys?", "a": "CMEK for compliance-controlled encryption; Google-managed keys are the default for simplicity." },
  { "id": "q22", "q": "What are BigQuery slots?", "a": "Slots are virtual CPUs for query execution; reservations and editions control slot availability and pricing." },
  { "id": "q23", "q": "Benefit of BigQuery BI Engine?", "a": "In-memory acceleration that delivers sub-second BI queries on BigQuery datasets." },
  { "id": "q24", "q": "How many clustering columns does BigQuery support?", "a": "Up to 4 clustering columns, best when filters/order-by align with clustered fields." },
  { "id": "q25", "q": "What roles are needed to run BigQuery jobs?", "a": "Dataset access plus roles/bigquery.jobUser (or bigquery.user) to run jobs in the project." },
  { "id": "q26", "q": "When to choose Bigtable over Spanner?", "a": "Pick Bigtable for wide-column, very large-scale, low-latency NoSQL (e.g., time-series/IoT) without multi-row transactions." },
  { "id": "q27", "q": "How does Pub/Sub handle retries and ordering?", "a": "At-least-once delivery; ordering is per ordering key; configure dead-letter topics for poison messages." },
  { "id": "q28", "q": "BigQuery ingestion methods?", "a": "Batch load jobs (CSV/JSON/Avro/Parquet), streaming inserts, or external tables over GCS." },
  { "id": "q29", "q": "What is Dataplex zone design?", "a": "Organize lakes into raw and curated zones, then assets, to separate ingestion from governed consumption." },
  { "id": "q30", "q": "Cost controls for BigQuery?", "a": "Use partitions/clusters to reduce scanned bytes, reservations for predictable slots, flex slots for bursts, and monitor via Admin tables." },
  { "id": "q31", "q": "How to design for late data in Beam?", "a": "Use windowing with triggers (early/late/on-time) and allowed lateness to handle delayed events." },
  { "id": "q32", "q": "What is the replay window of Pub/Sub?", "a": "You can replay messages for up to 7 days by seeking in a subscription." }
]

